Repository: mlforcada/llibre-tecnol-trad
Catalog: llibrett/omegat/tm/memtrad-tecnicasTA-usosTA.tmx
Source language: ca
Languages: es_es

source: [Solució 1 ($n$ mots):] El traductor professional tradueix un text de $n$ mots per 0,05$ n$ euros.
es_es: [Solución 1 ($n$ palabras):] El traductor profesional traduce un texto de $n$ palabras por 0,05$ n$ euros.

source: [Solució 2 (1000 mots):] El traductor professional tradueix un text de 1000 mots per 0,05$$1000$=$50 euros.
es_es: [Solución 2 (1000 palabras):] El traductor profesional traduce un texto de 1000 palabras por 0,05$$1000$=$50 euros.

source: [Traducció automàtica i aplicacions]{La traducció automàtica i les seues aplicacions}
es_es: [Traducción automática y aplicaciones]{La traducción automática y sus aplicaciones}

source: [Tècniques de TA]{Tècniques de traducció automàtica}
es_es: [Técnicas de TA]{Técnicas de traducción automática}

source: [_{SN} la comunitat ] [_{SN} les senyes d'identitat bàsiques [_{SP} de la qual ] ] ] ] $$ El sintagma nominal que segueix a cuyo (i hi concorda en gènere i nombre) pot ser, en principi, indefinidament llarg; cal identificar-lo correctament, moure'l com una unitat i afegir-li la frase relativa del qual de manera que concorde ara (en gènere i nombre) amb l'antecedent (el sintagma nominal anterior al cuyo).
es_es: [_{SN} la comunitat ] [_{SN} les senyes d'identitat bàsiques [_{SP} de la qual ] ] ] ] $$ El sintagma nominal que sigue a cuyo (y concuerda en género y número) puede ser, en principio, indefinidamente largo; hay que dentificarlo correctamente, moverlo como una unidad y añadirle la frase relativa del qual de manera que concuerde ahora (en género y número) con el antecedente (el sintagma nominal anterior al cuyo).

source: [tb] [Inicialització: Tots els alineament són igualment probables.]{}
es_es: [tb] [Inicialización: Todos los alineamientos son igualmente probables.]{}

source: `de' ) `SN$_2$' ) ) L'aplicació de la regla $R_2$ al ${SN}$ en l'arrel de l'arbre d'anàlisi sintàctica de la frase dóna com a resultat l'arbre que es veu en la figura .
es_es: `de' ) `SN$_2$' ) ) La aplicación de la regla $R_2$ al ${SN}$ en la raíz del árbol de análisis sintáctico de la frase da como resultado el árbol que se ve en la figura .

source: `SN$_2$' `A' ) i una altra per a reordenar els sintagmes nominals que contenen un genitiu saxó: $R_2:$ (.SN$_1$.
es_es: `SN$_2$' `A' ) y otra para reordenar los sintagmas nominales que contienen un genitivo sajón: $R_2:$ (.SN$_1$.

source: `car' ) ) ) ) {Arbre d'anàlisi sintàctica del sintagma nominal The old professor's smart girlfriend's red car.} Un sistema de transferència sintàctica de l'anglés al català podria usar dues regles per a transformar subarbres (parts de l'arbre), una per a moure els adjectius: $R_1:$ (.{SN}$_1$.
es_es: `car' ) ) ) ) {Árbol de análisis sintáctico del sintagma nominal The old professor's smart girlfriend's red car.} Un sistema de transferencia sintáctica del inglés al catalán podría usar dos reglas para transformar subárboles (partes del árbol), una para mover los adjetivos: $R_1:$ (.{SN}$_1$.

source: `girlfriend' ) ) ) ) ) ) {Arbre d'anàlisi sintàctica del sintagma The old professor's smart girlfriend's red car després d'aplicar-hi la regla $R_2$ al $SN$ principal o arrel (vegeu el text i la figura ).} Després caldria aplicar la regla $R_1$ al ${SN}$ que genera red car, després la regla $R_2$ al $SN$ que genera old professor's smart girlfriend, etc.
es_es: `girlfriend' ) ) ) ) ) ) {Árbol de análisis sintáctico del sintagma The old professor's smart girlfriend's red car después de aplicarle la regla $R_2$ al $SN$ principal o raíz (véase el texto y la figura ).} Después sería necesario aplicar la regla $R_1$ al ${SN}$ que genera red car, después la regla $R_2$ al $SN$ que genera old professor's smart girlfriend, etc.

source: `old' ) ) ) ) ) ) ) {Arbre d'anàlisi sintàctica del sintagma The old professor's smart girlfriend's red car després d'haver-hi fet tots els reordenaments possibles amb les regles $R_1$ i $R_2$ (vegeu el text i les figures i ).} i es correspon amb l'arbre d'anàlisi sintàctica de la traducció, El cotxe roig de l'amiga intel·ligent del professor vell, la qual es podria generar directament a partir de l'arbre.
es_es: `old' ) ) ) ) ) ) ) {Árbol de análisis sintáctico del sintagma The old professor's smart girlfriend's red car después de haber hecho todos los reordenamientos posibles con las reglas $R_1$ i $R_2$ (véase el texto y las figuras y ).} y se corresponde con el árbol de análisis sintáctico de la traducción, El coche rojo de la amiga inteligente del profesor viejo, que se podría generar directamente a partir del árbol.

source: acceptar
es_es: aceptar

source: anàlisi finalitzada
es_es: análisis finalizado

source: assigna gènere meta: subst \(\) adj
es_es: asigna género meta: sust \(\) adj

source: assigna nombre meta: subst \(\) adj
es_es: asigna número meta: sust \(\) adj

source: detectar ``determinant nom''; propagar el nombre (sing./pl.) del determinant maori (te/ng{a}) al nom català; propagar el gènere (masc./fem.) del nom català al determinant català.
es_es: detectar ``determinante nombre''; propagar el número (sing./pl.) del determinante maorí (te/ng{a}) al nombre catalán; propagar el género (masc./fem.) del nombre catalán al determinante catalán.

source: diccionari bilingüe
es_es: diccionario bilingüe

source: empilar det
es_es: apilar det

source: empilar n
es_es: apilar n

source: empilar v
es_es: apilar v

source: empilar-la
es_es: apilarla

source: empilar-lo
es_es: apilarlo

source: i de la necessitat de formular regles i mètodes per a automatitzar el procés.
es_es: y de la necesidad de formular reglas y métodos para automatizar el proceso.

source: i vindria bé col·locar-lo ací.}
es_es: y vendría bien colocarlo aquí.}

source: no calen experts bilingües per a construir mòduls de transferència (és poc versemblant que existisquen experts asturià-català o asturià-sard).
es_es: no hacen falta expertos bilingües para construir módulos de transferencia (es poco verosímil que existan expertos asturiano-catalán o asturiano-sardo).

source: on ${SN}$ és un sintagma nominal, ${SG}$ un ``sintagma de genitiu'', ${A}$ un adjectiu, ${N}$ un substantiu i ${GS}$ la partícula de genitiu saxó ('s, ').
es_es: donde ${SN}$ es un sintagma nominal, ${SG}$ un ``sintagma de genitivo'', ${A}$ un adjetivo, ${N}$ un sustantivo y ${GS}$ la partícula de genitivo sajón ('s, ').

source: postedició}) < cost(traducció professional).
es_es: postedición}) < coste(traducción profesional).

source: primàriament, per a identificar unitats terminològiques (``fondos estructurales'', ``Real Decreto'', ``política monetaria''), col·lo­cacions (``hacer frente'', ``tomar posiciones''), o noms d'entitat (``Nueva York'', ``Rodrigo Rato'', ``Unión Europea'') pròpies del text en qüestió.
es_es: primariamente, para identificar unidades terminológicas (``fondos estructurales'', ``Real Decreto'', ``política monetaria''), colocaciones (``hacer frente'', ``tomar posicionas''), o nombres de entidad (``Nueva York'', ``Rodrigo Rato'', ``Unión Europea'') propias del texto en cuestión.

source: reduir a $[_Nn]$
es_es: reducir a $[_Nn]$

source: reduir a $[_O [_{SN} ] [_{SV} ] ]$
es_es: reducir a $[_O [_{SN} ] [_{SV} ] ]$

source: reduir a $[_{{N}} n adj ]$
es_es: reducir a $[_{{N}} n adj ]$

source: reduir a $[_{{N}} {n} ]$
es_es: reducir a $[_{{N}} {n} ]$

source: reduir a $[_{SN} det [_{{N}} {n} ] ]$
es_es: reducir a $[_{SN} det [_{{N}} {n} ] ]$

source: reduir a $[_{SN} det [_{{N}} ] ]$
es_es: reducir a $[_{SN} det [_{{N}} ] ]$

source: reduir a $[_{SN} [_{{N}} ] ]$
es_es: reducir a $[_{SN} [_{{N}} ] ]$

source: reduir a $[_{SN} [_{SN} ] [_{SP} ] ]$
es_es: reducir a $[_{SN} [_{SN} ] [_{SP} ] ]$

source: reduir a $[_{SN} det[_{{N}} ] ]$
es_es: reducir a $[_{SN} det[_{{N}} ] ]$

source: reduir a $[_{SP} prep [_{SN} ] ]$
es_es: reducir a $[_{SP} prep [_{SN} ] ]$

source: reduir a $[_{SV} v [_{SN} ] ] ]$
es_es: reducir a $[_{SV} v [_{SN} ] ] ]$

source: reduir a $[_{SV} v [_{SN} ] ]$
es_es: reducir a $[_{SV} v [_{SN} ] ]$

source: reduir a $[_{SV} v ]$
es_es: reducir a $[_{SV} v ]$

source: reduir a $[_{SV} [_{SV} ] [_{SP} ] ]$
es_es: reducir a $[_{SV} [_{SV} ] [_{SP} ] ]$

source: secundàriament, per a decidir automàticament, per a un mot que té diverses traduccions, quina és la traducció que ``sona més natural'' davant o darrere de la traducció d'una altra.
es_es: secundariamente, para decidir automáticamente, para una palabra que tiene varias traducciones, cuál es la traducción que ``suena más natural'' delante o detrás de la traducción de otra.

source: situation n $$ situació n, gen=f
es_es: situation n $$ situación n, gen=f

source: {0.5cm}{TO} $$ {{0.2cm}{A}} $$ {1.0cm}{RATO} $$ {{0.2cm}{T}} $$ {1.25cm}{RATM} $$ {{0.25cm}{G}} $$ {0.5cm}{TM} {Fases d'anàlisi (A), transferència (T) i generació (G) en un sistema de traducció indirecta per transferència (TO = text origen; RATO = representació abstracta del text origen; RATM = representació abstracta del text meta; TM = text meta).}
es_es: {0.5cm}{TO} $$ {{0.2cm}{A}} $$ {1.0cm}{RATO} $$ {{0.2cm}{T}} $$ {1.25cm}{RATM} $$ {{0.25cm}{G}} $$ {0.5cm}{TM} {Fases de análisis (A), transferencia (T) y generación (G) en un sistema de traducción indirecta por transferencia (TO = texto origen; RATO = representación abstracta del texto origen; RATM = representación abstracta del texto meta; TM = texto meta).}

source: {{4cm}{CONFLICTE: reduir a $[_{SP} prep [_{SN} ] ]$ o empilar-la}}
es_es: {{4cm}{CONFLICTO: reducir a $[_{SP} prep [_{SN} ] ]$ o apilarla}}

source: {{4cm}{CONFLICTE: reduir a $[_{SV} v [_{SN} ] ]$ o empilar-la}}
es_es: {{4cm}{CONFLICTO: reducir a $[_{SV} v [_{SN} ] ]$ o apilarla}}

source: {Ací faltaria parlar, en algun lloc, de la relació entre les arquitectures de traducció automàtica i el principi de composicionalitat: treball per a Mikel, que ja té coses escrites.
es_es: {Aquí faltaría hablar, en algún lugar, de la relación entre las arquitecturas de traducción automática y el principio de composicionalidad: trabajo para Mikel, que ya tiene cosas escritas.

source: {Alineament entre les paraules de l'oració en anglés The white bird decided to fly. and les paraules de l'oració en català El pardal blanc va decidir volar.}
es_es: {Alineamiento entre las palabras de la oración en inglés The white bird decided to fly. y las palabras de la oración en catalán El pardal blanc va decidir volar.}

source: {Anàlisi i generació morfològiques}
es_es: {Análisis y generación morfológicas}

source: {Anàlisi sintàctica} L'anàlisi sintàctica pressuposa l'existència d'una gramàtica de la LO, és a dir, d'un conjunt de regles que descriuen com es construeixen, sintagma per sintagma, les oracions vàlides de la LO.
es_es: {Análisis sintáctico} El análisis sintáctico presupone la existencia de una gramática de la LO, es decir, de un conjunto de reglas que describen cómo se construyen, sintagma por sintagma, las oraciones válidas de la LO.

source: {Assimilació} En situacions d'assimilació de la informació no sembla necessària una traducció gramaticalment correcta i similar al text que produiria una persona nativa, sinó més aïna una traducció ràpida i raonablement intel·ligible.
es_es: {Asimilación} En situaciones de asimilación de la información no parece necesaria una traducción gramaticalmente correcta y similar al texto que produciría una persona nativa, sino más bien una traducción rápida y razonablemente inteligible.

source: {Com més profunda i complexa és l'anàlisi del text origen, més senzilla és (menys esforç comporta) la transferència a la representació corresponent de la llengua meta i més complexa la generació.
es_es: {Cuanto más profundo y complejo es el análisis del texto origen, más sencilla es (menos esfuerzo comporta) la transferencia a la representación correspondiente de la lengua meta y más compleja la generación.

source: {Crec que es podria explicar el model zero i col·locar la traducció directa com un cas típic de traducció indirecta ad hoc}
es_es: {Creo que se podría explicar el modelo cero y colocar la traducción directa como un caso típico de traducción indirecta ad hoc}

source: {Dels darrers noranta a l'actualitat:} La TA i les eines de suport a la traducció son cada vegada més usades per les grans empreses i per les administracions, principalment per a la traducció de documentació tècnica.
es_es: {Desde finales de los noventa hasta la actualidad:} La TA y las herramientas de apoyo a la traducción son cada vez más usadas por las grandes empresas y por las administraciones, principalmente para la traducción de documentación técnica.

source: {Des de l'informe ALPAC (1966) fins als vuitanta}: L'informe va acabar quasi virtualment amb la recerca en TA als Estats Units (també va tenir un impacte negatiu en els projectes desenvolupats a la resta del món) i durant molts anys la TA va ser percebuda com un autèntic fracàs.
es_es: {Desde el informe ALPAC (1966) hasta los ochenta}: El informe acabó casi virtualmente con la investigación de TA en los Estados Unidos (también tuvo un impacto negativo en los proyectos desarrollados en el resto del mundo) y durante muchos años la TA fue vista como un auténtico fracaso.

source: {Disseminació} En situacions de disseminació de la informació cal revisar l'esborrany de traducció produït pel traductor automàtic i fer les modificacions oportunes per convertir-la en una traducció adequada al propòsit de les traduccions.
es_es: {Diseminación} En situaciones de diseminación de la información hay que revisar el borrador de traducción producido por el traductor automático y hacer las modificaciones oportunas para convertirla en una traducción adecuada al propósito de las traducciones.

source: {El decenni de l'optimisme, 1954--1966:} La primera demostració pública d'un sistema de TA va ser desenvolupada per IBM i la Universitat Georgetown el 1954.
es_es: {El decenio del optimismo, 1954--1966:} La primera demostración pública de un sistema de TA fue desarrollada por IBM y la Universidad Georgetown en el año 1954.

source: {Els pioners, fins 1954:} La traducció mitjançant màquines és una ambició humana des de fa segles que no es va fer realitat fins al segle XX.
es_es: {Los pioneros, hasta 1954:} La traducción mediante máquinas es una ambición humana desde hace siglos, que no se hizo realidad hasta el siglo XX.

source: {Els primers noranta:} Tots els sistemes de TA dels vuitanta, tant els de transferència com els d'interlingua, funcionen bàsicament a partir de regles lingüístiques.
es_es: {A principios de los noventa:} Todos los sistemas de TA de los ochenta, tanto los de transferencia como los de interlingua, funcionan básicamente a partir de reglas lingüísticas.

source: {Els primers vuitanta:} Als 1980 apareixen nous sistemes de TA arreu del món amb expectatives més reals i l'interés en la TA resorgeix.
es_es: {A principios de los ochenta:} En los 80 aparecen nuevos sistemas de TA en todo el mundo con expectativas más reales y el interés en la TA vuelve a surgir.

source: {Fase de transferència d'un sistema senzill de transferència morfològica avançada, amb regles de transferència estructural que fan el reordenament i la concordança, entre les quals hi ha la regla per reordenar la seqüència determinant--adjectiu--substantiu i assegurar la concordança de nombre i gènere en la llengua meta.}
es_es: {Fase de transferencia de un sistema sencillo de transferencia morfológica avanzada, con reglas de transferencia estructural que hacen el reordenamiento y la concordancia, entre las cuales está la regla para reordenar la secuencia determinante--adjetivo--sustantivo y asegurar la concordancia de número y género en la lengua meta.}

source: {Freqüències d'aparició de parells de mots sobre economia.}
es_es: {Frecuencias de aparición de pares de palabras sobre economía.}

source: {HAMT:} Un programa de traducció automàtica pregunta a l'usuari quan té més d'una possible traducció per a un mot o per a una frase.
es_es: {HAMT:} Un programa de traducción automática pregunta al usuario cuándo tiene más de una traducción posible para una palabra o para una frase.

source: {Llenguatges controlats} Quan la traducció automàtica s'usa per a la disseminació de documents tècnics de temàtica homogènia, pot ser interessant fer que els documents originals estiguen escrits usant un lèxic estàndard sense ambigüitats semàn­ti­ques i seguint unes regles sintàctiques i d'estil ben determinades, és a dir, en un llenguatge controlat {wojcik96u,arnold94b,o2003controlling} dissenyat de manera que el resultat de la traducció automàtica puga ser usat directament per a publicar-lo amb el mínim possible de postedició.
es_es: {Lenguajes controlados} Cuando la traducción automática se usa para la diseminación de documentos técnicos de temática homogénea, puede ser interesante hacer que los documentos originales estén escritos usando un léxico estándar sin ambigüedades semán­ti­cas y siguiendo unas reglas sintácticas y de estilo muy determinadas, es decir, en un lenguaje controlado {wojcik96uno,arnold94b,o2003controlling} diseñado de forma que el resultado de la traducción automática pueda ser usado directamente para publicarlo con el mínimo posible de postedición.

source: {MAHT:} L'usuari (un traductor competent o un professional independent) utilitza diccionaris bilingües, tesaurus o thesauri, conjugadors i declinadors, correctors ortogràfics, sintàctics i d'estil, i formularis o models de documents, com a ajuda mentre produeix una traducció de manera manual usant un processador de textos.
es_es: {MAHT:} El usuario (un traductor competente o un profesional independiente) utiliza diccionarios bilingües, tesauros thesauri, conjugadores y declinadores, correctores ortográficos, sintácticos y de estilo, y formularios o modelos de documentos, como ayuda mientras produce una traducción de manera manual usando un procesador de textos.

source: {Oracions paral·leles anglés-espanyol extretes del corpus paral·lel Europarl (http://www.statmt.org/europarl/) amb les actes del Parlament Europeu de període 1996--2011.}
es_es: {Oraciones paralelas inglés-español extraídas del corpus paralelo Europarl (http://www.statmt.org/europarl/) con las actas del Parlamento Europeo de periodo 1996--2011.}

source: {Postedició} La postedició és la modificació mínima d'una traducció generada per ordinador per a fer-la adequada a un propòsit ben definit: el text meta produït pel sistema es refina o revisa ({ postedita}) perquè siga gramaticalment correcte o estiga escrit d'acord amb un registre determinat.
es_es: {Postedición} La postedición es la modificación mínima de una traducción generada por ordenador para hacerla adecuada a un propósito bien definido: el texto meta producido por el sistema se refina o revisa ({ postedita}) para que sea gramaticalmente correcto o esté escrito de acuerdo con un registro determinado.

source: {Preedició} La preedició consisteix a preparar o adaptar (preeditar) el text origen per a facilitar la seua traducció i millorar el comportament del sistema de traducció automàtica, reduint-ne la necessitat de postedició de la traducció en brut.
es_es: {Preedición} La preedición consiste en preparar o adaptar (preeditar) el texto origen para facilitar su traducción y mejorar el comportamiento del sistema de traducción automática, reduciendo la necesidad de postedición de la traducción en bruto.

source: {Sistemes de traducció automàtica estadística} La principal tècnica de traducció automàtica basada en corpus es la traducció automàtica estadística (en anglés statistical machine translation; SMT), la qual va ser inventada cap a finals dels huitanta per un grup d'investigadors d'IBM {brown90j}; els sistemes actuals són una evolució d'aquests.
es_es: {Sistemas de traducción automática estadística} La principal técnica de traducción automática basada en corpus es la traducción automática estadística (en inglés statistical machine translation; SMT), que fue inventada hacia finales de los ochenta por un grupo de investigadores de IBM {brown90j}; los sistemas actuales son una evolución de estos.

source: {Sistemes de transferència morfològica avançada}
es_es: {Sistemas de transferencia morfológica avanzada}

source: {Sistemes de transferència semàntica}
es_es: {Sistemas de transferencia semántica}

source: {Sistemes de transferència sintàctica}
es_es: {Sistemas de transferencia sintáctica}

source: {Sobre el nom en altres llengües.} En anglés, la traducció automàtica s'anomena machine translation i s'abreuja MT, paral·lelament a l'alemany, que usa la denominació maschinelle übersetzung; en aquestes dues llengües s'expressa la noció d'automatisme mitjançant la referència a una { màquina}.
es_es: {Sobre el nombre en otras lenguas.} En inglés, la traducción automática se denomina machine translation y se abrevia MT, paralelamente al alemán, que usa la denominación maschinelle übersetzung; en estas dos lenguas se expresa la noción de automatismo mediante la referencia a una { máquina}.

source: {Tinc en la llibreta un esquema en què apareix tot el procés de HAMT: preedició, postedició, interacció, etc.
es_es: {Tengo en la libreta un esquema en el que aparece todo el proceso de HAMT: preedición, postedición, interacción, etc.

source: {Va adquirir} el navegant el-OBJ control-OBJ TA: El navegant va adquirir el control (correcta).
es_es: {Adquirió} el navegante el-OBJ control-OBJ TA: El navegante adquirió el control (correcta).

source: {l'anàlisi morfològica} Quan els mecanismes de flexió de les llengües són, com en la major part de les llengües indoeuropees, per modificació de les terminacions (desi­nèn­cies) dels mots, un mètode atractiu consisteix a processar la forma superficial lletra a lletra d'esquerra a dreta i produir la forma lèxica incrementalment, afegint a cada pas més informació.
es_es: {el análisis morfológico} Cuando los mecanismos de flexión de las lenguas son, como en la mayor parte de las lenguas indoeuropeas, por modificación de las terminaciones (desi­nen­cias) de las palabras, un método atractivo consiste en procesar la forma superficial letra a letra de izquierda a derecha y producir la forma léxica incrementalmente, agregando en cada paso más información.

source: {l'anàlisi sintàctica} Els algorismes d'anàlisi sintàctica poden ser { ascendents} (anglés bottom-up) quan construeixen l'arbre començant a partir de les fulles ---les categories lèxiques de cada mot--- anant cap a l'arrel ---el qual correspon a l'oració completa---, o descendents (anglés top-down), en cas contrari (recordeu que els arbres d'anàlisi sintàctica estan ``cap per avall'': l'arrel és a dalt i les fulles, a baix).
es_es: {el análisis sintáctico} Los algoritmos de análisis sintáctico pueden ser { ascendentes} (inglés bottom-up) cuando construyen el árbol empezando por las hojas ---las categorías léxicas de cada palabra--- y acabando por la raíz ---que corresponde a la oración completa---, o descendentes (inglés top-down), en caso contrario (recordad que los árboles de análisis sintáctico están ``cabeza abajo'': la raíz está arriba y las hojas, abajo).

source: {la història de la traducció automàtica} La major part del discutit d'aquest apartat està pres dels treballs de John Hutchins, especialment de i .
es_es: {la historia de la traducción automática} La mayor parte de lo discutido en este apartado se ha extraído de los trabajos de John Hutchins, especialmente de y .

source: {p{6cm}|p{6cm}} {1}{c|}{Anglés}
es_es: {p{6cm}|p{6cm}} {1}{c|}{Inglés}
